{
  "nodes": [
    {
      "op": "_arange", 
      "name": "bertencoder0__arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "True", 
        "repeat": "1", 
        "start": "0", 
        "step": "1", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertmodel0_word_embed_embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(119547, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "bertmodel0_word_embed_embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "119547", 
        "output_dim": "768", 
        "sparse_grad": "False"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertmodel0_word_embed_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertmodel0_token_type_embed_embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(2, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "bertmodel0_token_type_embed_embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "2", 
        "output_dim": "768", 
        "sparse_grad": "False"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertmodel0_token_type_embed_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertmodel0__plus0", 
      "inputs": [[4, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "bertencoder0_slice0", 
      "attrs": {
        "begin": "(0, 0, 0)", 
        "end": "(1, None, 1)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_reshape0", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "bertencoder0_zeros_like0", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_elemwise_add0", 
      "inputs": [[0, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_reshape1", 
      "attrs": {"shape": "(1, -1)"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_reshape2", 
      "attrs": {"shape": "(-1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "bertencoder0_broadcast_lesser0", 
      "inputs": [[14, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "bertencoder0_ones_like0", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_reshape3", 
      "attrs": {"shape": "(-1, 1)"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "bertencoder0_broadcast_mul0", 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "bertencoder0_broadcast_mul1", 
      "inputs": [[18, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer11_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer11_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer11_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer10_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer10_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer10_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer9_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer9_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer9_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer8_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer8_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer8_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer7_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer7_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer7_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer6_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer6_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer6_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer5_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer5_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer5_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer4_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer4_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer4_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer3_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer3_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer3_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_position_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "bertencoder0_embedding0", 
      "attrs": {
        "input_dim": "512", 
        "output_dim": "768"
      }, 
      "inputs": [[13, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "bertencoder0_broadcast_add0", 
      "inputs": [[9, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_bertlayernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_bertlayernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_bertlayernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_query_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_query_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape0", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "_contrib_div_sqrt_dim", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_div_sqrt_dim0", 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_key_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_key_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[66, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape2", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape3", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_batch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[73, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_ones_like0", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0__mulscalar0", 
      "attrs": {"scalar": "-1e+18"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_where0", 
      "inputs": [[58, 0, 0], [80, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_softmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0__mul0", 
      "inputs": [[84, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer0_dotproductattentioncell0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape5", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 12, 0, 0)"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape6", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_value_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_value_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[66, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape7", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape8", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_batch_dot1", 
      "inputs": [[88, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape9", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 12, 0, 0)"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_multiheadattentioncell0_reshape10", 
      "attrs": {"shape": "(0, 0, -1)"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_proj_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_proj_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_proj_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer0__plus0", 
      "inputs": [[102, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertlayernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertlayernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer0_bertlayernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_ffn_1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_ffn_1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_ffn_1_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_gelu0__mulscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_gelu0__divscalar0", 
      "attrs": {"scalar": "1.4142135623730951"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "erf", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_gelu0_erf0", 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_gelu0__plusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_gelu0__mul0", 
      "inputs": [[110, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_ffn_2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_ffn_2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_ffn_2_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0__plus0", 
      "inputs": [[118, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_bertlayernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_bertlayernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer0_bertpositionwiseffn0_bertlayernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_query_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_query_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape0", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "_contrib_div_sqrt_dim", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_div_sqrt_dim0", 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_key_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_key_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[122, 0, 0], [130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape2", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape3", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_batch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[129, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_ones_like0", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0__mulscalar0", 
      "attrs": {"scalar": "-1e+18"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_where0", 
      "inputs": [[55, 0, 0], [136, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_softmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0__mul0", 
      "inputs": [[140, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer1_dotproductattentioncell0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape5", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 12, 0, 0)"
      }, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape6", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_value_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_value_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[122, 0, 0], [145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape7", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape8", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_batch_dot1", 
      "inputs": [[144, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape9", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 12, 0, 0)"
      }, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_multiheadattentioncell0_reshape10", 
      "attrs": {"shape": "(0, 0, -1)"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_proj_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_proj_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_proj_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer1_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer1__plus0", 
      "inputs": [[158, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertlayernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertlayernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer1_bertlayernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_ffn_1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_ffn_1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_ffn_1_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_gelu0__mulscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_gelu0__divscalar0", 
      "attrs": {"scalar": "1.4142135623730951"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "erf", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_gelu0_erf0", 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_gelu0__plusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_gelu0__mul0", 
      "inputs": [[166, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_ffn_2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_ffn_2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_ffn_2_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0__plus0", 
      "inputs": [[174, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_bertlayernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_bertlayernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer1_bertpositionwiseffn0_bertlayernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_query_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_query_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape0", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "_contrib_div_sqrt_dim", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_div_sqrt_dim0", 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_key_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_key_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[178, 0, 0], [186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape2", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape3", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_batch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[185, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_ones_like0", 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0__mulscalar0", 
      "attrs": {"scalar": "-1e+18"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_where0", 
      "inputs": [[52, 0, 0], [192, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_softmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0__mul0", 
      "inputs": [[196, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer2_dotproductattentioncell0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape5", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 12, 0, 0)"
      }, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape6", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_value_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_value_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[178, 0, 0], [201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape7", 
      "attrs": {"shape": "(0, 0, 12, -1)"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape8", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0, 0)"
      }, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_batch_dot1", 
      "inputs": [[200, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape9", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 12, 0, 0)"
      }, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_multiheadattentioncell0_reshape10", 
      "attrs": {"shape": "(0, 0, -1)"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_proj_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_proj_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_proj_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[210, 0, 0], [211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer2_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer2__plus0", 
      "inputs": [[214, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_bertlayernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_bertlayernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
